Res-firecracker-set-v7/firecracker_t_10_c_30_frontVcpu_4_wrkVcpu_2/wrk.txt
Running 1m test @ http://frontend:5000
  10 threads and 30 connections
  Thread calibration: mean lat.: 5189.155ms, rate sampling interval: 17924ms
  Thread calibration: mean lat.: 4247.060ms, rate sampling interval: 17039ms
  Thread calibration: mean lat.: 5120.599ms, rate sampling interval: 17940ms
  Thread calibration: mean lat.: 5039.626ms, rate sampling interval: 17940ms
  Thread calibration: mean lat.: 5074.006ms, rate sampling interval: 17580ms
  Thread calibration: mean lat.: 5073.553ms, rate sampling interval: 17891ms
  Thread calibration: mean lat.: 5062.795ms, rate sampling interval: 17989ms
  Thread calibration: mean lat.: 5196.963ms, rate sampling interval: 17874ms
  Thread calibration: mean lat.: 5105.012ms, rate sampling interval: 17760ms
  Thread calibration: mean lat.: 5231.126ms, rate sampling interval: 18087ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    32.02s    12.96s    0.97m    61.78%
    Req/Sec   230.90      5.86   241.00     65.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   31.16s 
 75.000%   42.01s 
 90.000%   50.69s 
 99.000%    0.97m 
 99.900%    0.99m 
 99.990%    0.99m 
 99.999%    0.99m 
100.000%    1.00m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    3035.135     0.000000            2         1.00
   14614.527     0.100000        11560         1.11
   19365.887     0.200000        23101         1.25
   23822.335     0.300000        34635         1.43
   27475.967     0.400000        46223         1.67
   31162.367     0.500000        57748         2.00
   33112.063     0.550000        63530         2.22
   35225.599     0.600000        69321         2.50
   37519.359     0.650000        75094         2.86
   39813.119     0.700000        80847         3.33
   42008.575     0.750000        86577         4.00
   43253.759     0.775000        89543         4.44
   44498.943     0.800000        92379         5.00
   45645.823     0.825000        95239         5.71
   47120.383     0.850000        98136         6.67
   48824.319     0.875000       101039         8.00
   49774.591     0.887500       102504         8.89
   50692.095     0.900000       103919        10.00
   51609.599     0.912500       105397        11.43
   52461.567     0.925000       106802        13.33
   53477.375     0.937500       108239        16.00
   54067.199     0.943750       108981        17.78
   54624.255     0.950000       109678        20.00
   55148.543     0.956250       110427        22.86
   55640.063     0.962500       111125        26.67
   56164.351     0.968750       111854        32.00
   56426.495     0.971875       112195        35.56
   56655.871     0.975000       112558        40.00
   56918.015     0.978125       112943        45.71
   57180.159     0.981250       113296        53.33
   57442.303     0.984375       113670        64.00
   57573.375     0.985938       113840        71.11
   57737.215     0.987500       114010        80.00
   57901.055     0.989062       114181        91.43
   58130.431     0.990625       114382       106.67
   58294.271     0.992188       114556       128.00
   58392.575     0.992969       114637       142.22
   58490.879     0.993750       114741       160.00
   58589.183     0.994531       114806       182.86
   58720.255     0.995313       114898       213.33
   58884.095     0.996094       115003       256.00
   58949.631     0.996484       115047       284.44
   59015.167     0.996875       115100       320.00
   59080.703     0.997266       115145       365.71
   59146.239     0.997656       115196       426.67
   59179.007     0.998047       115226       512.00
   59211.775     0.998242       115256       568.89
   59211.775     0.998437       115256       640.00
   59244.543     0.998633       115283       731.43
   59310.079     0.998828       115307       853.33
   59342.847     0.999023       115341      1024.00
   59342.847     0.999121       115341      1137.78
   59375.615     0.999219       115353      1280.00
   59408.383     0.999316       115362      1462.86
   59441.151     0.999414       115378      1706.67
   59473.919     0.999512       115397      2048.00
   59473.919     0.999561       115397      2275.56
   59473.919     0.999609       115397      2560.00
   59473.919     0.999658       115397      2925.71
   59506.687     0.999707       115403      3413.33
   59539.455     0.999756       115417      4096.00
   59539.455     0.999780       115417      4551.11
   59539.455     0.999805       115417      5120.00
   59539.455     0.999829       115417      5851.43
   59572.223     0.999854       115427      6826.67
   59572.223     0.999878       115427      8192.00
   59572.223     0.999890       115427      9102.22
   59572.223     0.999902       115427     10240.00
   59572.223     0.999915       115427     11702.86
   59604.991     0.999927       115433     13653.33
   59604.991     0.999939       115433     16384.00
   59604.991     0.999945       115433     18204.44
   59604.991     0.999951       115433     20480.00
   59604.991     0.999957       115433     23405.71
   59604.991     0.999963       115433     27306.67
   59604.991     0.999969       115433     32768.00
   59604.991     0.999973       115433     36408.89
   59637.759     0.999976       115435     40960.00
   59637.759     0.999979       115435     46811.43
   59637.759     0.999982       115435     54613.33
   59637.759     0.999985       115435     65536.00
   59637.759     0.999986       115435     72817.78
   59637.759     0.999988       115435     81920.00
   59637.759     0.999989       115435     93622.86
   59637.759     0.999991       115435    109226.67
   59703.295     0.999992       115436    131072.00
   59703.295     1.000000       115436          inf
#[Mean    =    32017.390, StdDeviation   =    12964.589]
#[Max     =    59670.528, Total count    =       115436]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  138149 requests in 1.00m, 57.05MB read
  Socket errors: connect 0, read 0, write 0, timeout 31
Requests/sec:   2302.34
Transfer/sec:      0.95MB